# Задание 1
print("Введите стороны прямоугольника.")
print("Длина: ")
l= float(input())
print("Ширина: ")
w= float(input())
print("Площадь прямоугольника равна", l*w)
print("Периметр прямоугольника равен", (l+w)*2)

# Задание 2
N=46275
n1 = N % 10
n10 = N % 100 // 10
n100 = N % 1000 // 100
d = N // 10000 - N % 10000 // 1000
print(n1, n10, n100, d)
print(n10**n1*n100/d)

# Задание 2
# Способ 2, выдал студент
a,b,c,d,e = map(int, input())
print(d**e*c/(a-b))